# BuiltInFailures.ColumnInsideWallFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnInsideWallFailures Class
BuiltInFailures Class Members See Also
---
Failures description ColumnInsideWall
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ColumnInsideWallFailures
```

Visual Basic
---
```text
Public NotInheritable Class ColumnInsideWallFailures
```

Visual C++
---
```text
public ref class ColumnInsideWallFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ColumnInsideWallFailures
# See Also
BuiltInFailures..::..ColumnInsideWallFailures Members
Autodesk.Revit.DB Namespace